app/controllers/submissions_controller.rb

  def index
    @submissions = Submission.all
---
SELECT * FROM `submissions`

  def show
    @submission = Submission.find(params[:id])
---
SELECT * FROM `submissions` WHERE (`submissions`.`id` = 980190962)

  def edit
    @submission = Submission.find(params[:id])
---
SELECT * FROM `submissions` WHERE (`submissions`.`id` = 980190962)

  def create
    @submission = Submission.new(params[:submission])

    respond_to do |format|
      if @submission.save
---
INSERT INTO `submissions` (`name`, `comment`, `location`, `created_at`, `updated_at`, `role`) VALUES(NULL, NULL, NULL, '2010-02-06 22:05:50', '2010-02-06 22:05:50', NULL)

  def update
    @submission = Submission.find(params[:id])
---
SELECT * FROM `submissions` WHERE (`submissions`.`id` = 980190962)

  def destroy
    @submission = Submission.find(params[:id])
    @submission.destroy
---
SELECT * FROM `submissions` WHERE (`submissions`.`id` = 980190962)
DELETE FROM `submissions` WHERE `id` = 980190962